[
  {
    "author": "relaiapp",
    "author_fullname": "t2_vh22ibg0",
    "title": "And on the eighth day, God created sound money",
    "selftext": "",
    "created": 1744296000,
    "label": "Bullish"
  },
  {
    "author": "Fearless_Agent_1985",
    "author_fullname": "t2_n0chpe1r",
    "title": "Bitcoin is the new gold.",
    "selftext": "",
    "created": 1744295700,
    "label": "Bullish"
  },
  {
    "author": "crakked21",
    "author_fullname": "t2_jxn6qj3q",
    "title": "Is Bitcoin really a good investment?",
    "selftext": "What market forces make it so it keeps getting up? Sorry if it sounded really hateful i'm just really inquisitive about it and I want to know that it's not just going up because of speculation",
    "created": 1744294100,
    "label": "Neutral"
  },
  {
    "author": "johndoeisback",
    "author_fullname": "t2_b1xwz",
    "title": "Stay away from leverage - Personal experience",
    "selftext": "I wanted to share my experience for those who are considering leverage trading.\n\nI've been in this space for over a decade and early on I learned I should stay away from leverage... or rather I thought I did. For some reason (long story) I decided to go long on bitcoin with leverage. I wanted to be stress-free so I kept a significant balance (5 figures) and used little margin. I entered at around 82k last week and my liquidation was at around 74k, which I thought was very safe. All was good until Sunday. I can't explain the stress I suffered the following days. At some point the price touched 74.4k, very close to liquidation. The whole time I was literally [this guy](https://www.memeatlas.com/images/wojaks/wojak-stage-6-doomer.png) looking at the chart deciding whether to exit and lose 60/70/80% or wait. I couldn't work, eat, spend time with family or friends, or do anything other than think about why I did this stupid trade. It was money that I could afford to lose, but the psychological damage of losing it would have been hard. In any case I decided to wait. Fortunately yesterday I was able to exit safely with minimal loss (I could have waited more and exit with gains but I wanted to be out ASAP).\n\nI think my life expectancy just dropped a little after all this, but hopefully this time I learned the lesson. No more leverage trading for me. I truly can't believe people do this on a daily basis!",
    "created": 1744293800,
    "label": "Bearish"
  },
  {
    "author": "Charming-Horror-9688",
    "author_fullname": "t2_1897ofma7f",
    "title": "Phuket",
    "selftext": "I am in Phuket, Thailand and want to buy bitcoin but only have cash. Any places that offers this service? ",
    "created": 1744292200,
    "label": "Neutral"
  },
  {
    "author": "TheReader369",
    "author_fullname": "t2_1mr24407bc",
    "title": "What do you think of this book?",
    "selftext": "Name: Bitcoin Red Pill: The Moral, Material and Technological Renaissance.\n\nBy the author Renato Amoedo",
    "created": 1744291800,
    "label": "Bullish"
  },
  {
    "author": "Rocket_Edrag",
    "author_fullname": "t2_oz571gx1n",
    "title": "So, what's the effect of cpi in bitcoin?",
    "selftext": "New to bitcoin. No idea what cpi gonna do when it is less than predicted? Should I buy it?",
    "created": 1744291500,
    "label": "Neutral"
  },
  {
    "author": "SodanReddit",
    "author_fullname": "t2_450z17kk",
    "title": "Blockstream Jade",
    "selftext": "I am thinking about buying my first hardware wallet and the blockstream Jade plus seems like a good choice. Can it be used completely air gapped, and how is that done.  Would you say it is difficult? Appreciate any advice.",
    "created": 1744291100,
    "label": "Neutral"
  },
  {
    "author": "Motod0shi",
    "author_fullname": "t2_1mvmdfripr",
    "title": "Please be careful . Bitcoin will decline to $78.000 level",
    "selftext": "",
    "created": 1744291100,
    "label": "Bearish"
  },
  {
    "author": "Flatboardman",
    "author_fullname": "t2_1mwi91ka2v",
    "title": "New to investing",
    "selftext": "Hey all, I’ve just lately brushed up on bitcoin as I used it to buy weed and stuff back in 2014, so I understand how to exchange it safely. I would like to start investing in it like $10 a week. The only problem is now I don’t know how to go about doing so in the best way without avoiding fees, I currently use Kraken to exchange cash or crypto, and then keep it in an electrum wallet. What would be the best strategy for throwing $10 at it every week regarding the fees?",
    "created": 1744291100,
    "label": "Neutral"
  },
  {
    "author": "ConstantAd3126",
    "author_fullname": "t2_kl3lnriy",
    "title": "How do i set up a bitcoin wallet ?",
    "selftext": "im not interested in making more money by buying bitcoin. The reason im interested in a bitcoin wallet is because i heard its the safest way to exchange money. In that case, how do i set up an account? ",
    "created": 1744286200,
    "label": "Neutral"
  },
  {
    "author": "TheReader369",
    "author_fullname": "t2_1mr24407bc",
    "title": "How do artificial intelligence and Bitcoin relate?",
    "selftext": "How does the relationship between AI and Bitcoin work? How can they help each other?",
    "created": 1744286100,
    "label": "Neutral"
  },
  {
    "author": "0a0d0s0",
    "author_fullname": "t2_5rpyz",
    "title": "Using BTC as Collateral: How Do You Cover Loan Repayments Without Selling?",
    "selftext": "Hey everyone\n\nI've been exploring the idea of using BTC as collateral to borrow funds, while maintaining long-term exposure and potentially avoiding taxable events from selling. However, my main concern is managing the repayment process.\n\nFor example, if I pledge *x* BTC as collateral for a loan of *x* dollars, the arrangement would require monthly repayments (interest, and possibly part of the principal). So, my question is: How do you fund these repayments without ever having to sell your BTC? Do you rely on other income sources entirely, or are there creative strategies that have worked for you?\n\nI'm curious about your experiences, insights, and any pitfalls you've encountered with this strategy. Looking forward to your advice!\n\nThanks in advance.",
    "created": 1744283500,
    "label": "Neutral"
  },
  {
    "author": "xr23z",
    "author_fullname": "t2_lvmud6k3l",
    "title": "Need help with orderflow",
    "selftext": "Hlo everyone. I want to learn order flow. I use atas as I can't afford exo charts. Its been 3 months in volume analysis(TPO and Volume profile)and its good and something its amaze me how good volume analysis works. But still learning\n\nI want to learn order flow i know basic like footprint chart, delta and CVD(i use aggr spot cvd).\n But confused in how to sync all this and how to read orderflow properly.. \n",
    "created": 1744283400,
    "label": "Unclear"
  },
  {
    "author": "JoeNakamoto",
    "author_fullname": "t2_v2ph3pbw",
    "title": "Off grid bitcoin mine in east africa",
    "selftext": "Full video: https://youtu.be/J2K1fgVyh5Y?si=MlMgSVlMW3llUCoZ",
    "created": 1744275500,
    "label": "Bullish"
  },
  {
    "author": "Bubbly_Ice3836",
    "author_fullname": "t2_1m8segv4k7",
    "title": "Bitcoin mining on EVs?",
    "selftext": "Can it be done on some heavy duty electric vehicles? Moving targets are harder to attack. ",
    "created": 1744274800,
    "label": "Bullish"
  },
  {
    "author": "BluffJamRiver",
    "author_fullname": "t2_un1rgs8v",
    "title": "BTC Percentiles",
    "selftext": "How Much BTC do you have to own to be in the top 10%, 5%, 1% of all BTC holders?",
    "created": 1744274200,
    "label": "Neutral"
  },
  {
    "author": "RexedgeAR",
    "author_fullname": "t2_s1rhgd65c",
    "title": "A WHALE JUST BOUGHT $147.94 MILLION WORTH OF $BTC WHAT A LEGEND 🔥",
    "selftext": "",
    "created": 1744271000,
    "label": "Bullish"
  },
  {
    "author": "Jagon38",
    "author_fullname": "t2_96vdxf30",
    "title": "Damn! Selling all my BTC for fiat right away!",
    "selftext": "",
    "created": 1744269300,
    "label": "Bearish"
  },
  {
    "author": "rBitcoinMod",
    "author_fullname": "t2_tcsf5",
    "title": "⚡ Lightning Thursday! April 10, 2025: Explore the Lightning Network!⚡",
    "selftext": "The lightning network is a second-layer solution on top of the Bitcoin blockchain that enables quick, cheap and scalable Bitcoin payments.\r\n\r\nHere is the place to discuss and learn more about lightning!\r\n\r\nAsk your questions about lightning\r\n\r\nProvide reviews, feedback, comparisons of LN apps, services, websites etc\r\n\r\nLearn about new LN features, development, apps\r\n\r\nLink to good quality resources (articles, wikis etc)\r\n\r\nResources:\r\n\r\n* Here is an awesome list of resources compiled by Jameson Lopp: https://www.lopp.net/lightning-information.html\r\n\r\n* Want to test out your lightning fire power? tip the Bitcoin devs! https://bitcoindevlist.com/\r\n\r\n* Previous threads: [Search](https://www.reddit.com/r/Bitcoin/search?q=Lightning+Thursday&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\r\n\r\n* Lnbook getting closer towards being finished and can already be seen at: https://github.com/lnbook/lnbook\r\n\r\n* Lightning Dedicated YouTube Channel: https://youtube.com/renepickhardt\r\n\r\n* Also there is the playlist by chaincode labs: https://youtube.com/playlist?list=PLpLH33TRghT17_U3as2P3vHfAGL8pSOOY\r\n\r\n* Lightning stores: https://www.lightningnetworkstores.com/\r\n\r\n* Learn more and talk about lightning right here in r/Bitcoin, r/bitcoinbeginners, r/thelightningnetwork, and [the r/Bitcoin chat](https://discord.gg/qE3rWBRNqh)",
    "created": 1744269000,
    "label": "Bullish"
  },
  {
    "author": "Bubbly_Ice3836",
    "author_fullname": "t2_1m8segv4k7",
    "title": "More Bitcoin Transactions",
    "selftext": "Source: https://bitinfocharts.com/comparison/bitcoin-transactions.html",
    "created": 1744266000,
    "label": "Neutral"
  },
  {
    "author": "rBitcoinMod",
    "author_fullname": "t2_tcsf5",
    "title": "Daily Discussion, April 10, 2025",
    "selftext": "Please utilize this sticky thread for all general **Bitcoin** discussions! If you see posts on the front page or /r/Bitcoin/new which are better suited for this daily discussion thread, please help out by directing the OP to this thread instead. Thank you!\n\nIf you don't get an answer to your question, you can try phrasing it differently or commenting again tomorrow.\n\nPlease check the [previous discussion thread](https://www.reddit.com/r/Bitcoin/comments/1juyvan/daily_discussion_april_09_2025/) for unanswered questions.",
    "created": 1744265000,
    "label": "Unclear"
  },
  {
    "author": "Illustrious-Boss9356",
    "author_fullname": "t2_84jpn94u",
    "title": "Whole coiner definition",
    "selftext": "So I'm trying to decide if I'm technically a whole coiner.  \n\nThis is all hypothetical: If I have 0.8 BTC on cold storage and 0.25 BTC via ARKB, would you consider that a whole coiner?  Technically I can't send 1 coin of value on the network, so I can understand the argument for no.  But I also have over 1 BTC of financial exposure, so you could argue yes.  \n\nThoughts?",
    "created": 1744264100,
    "label": "Bullish"
  },
  {
    "author": "Supermanass",
    "author_fullname": "t2_6ohft9n5",
    "title": "I came 3 years from the future to tell you one message. “HOLD.”",
    "selftext": "Throughout the history of bitcoin, there has never been a three year period where the value of bitcoin at the end of the three year period was less than the beginning of the three year period. \n\nEverything else is just noise. \n\n\n\n",
    "created": 1744258700,
    "label": "Bullish"
  },
  {
    "author": "jirachisvs",
    "author_fullname": "t2_1hl2ygknzd",
    "title": "Wallet",
    "selftext": "A secure wallet so I can download it to my computer and leave all my BTC there? ",
    "created": 1744257400,
    "label": "Bullish"
  },
  {
    "author": "Bubbly_Ice3836",
    "author_fullname": "t2_1m8segv4k7",
    "title": "What made you use Bitcoin",
    "selftext": "Back in 2015, I needed to buy some weed but my local dealer only accepted bitcoin..",
    "created": 1744253200,
    "label": "Neutral"
  },
  {
    "author": "WinOutrageous1190",
    "author_fullname": "t2_g653qk60",
    "title": "Honest question, did you buy the fear? Or still looking at useless charts",
    "selftext": "Can you please stop playing with charts.. just stop.. DCA heavily when it dips and enjoy the sauce. Simple as that ",
    "created": 1744250400,
    "label": "Bullish"
  },
  {
    "author": "TrickNo3163",
    "author_fullname": "t2_apxb4oc0",
    "title": "Important question",
    "selftext": "Do any of you send big amounts of bitcoin? If yes, what issues do you encounter? Just curious lol",
    "created": 1744250200,
    "label": "Neutral"
  },
  {
    "author": "BQbaobao",
    "author_fullname": "t2_t0bzr",
    "title": "Paper BTC",
    "selftext": "Serious question here, not trolling.\n\nRegarding these accusations against Coinbase about paper bitcoin, surely they could easily disprove the allegations via the immutable blockchain.\n\nBut they haven’t.\n\nLet’s assume for a second that they do indeed hold the coins they say they have.\n\nAre there any valid arguments as to why they would not want to prove it to everyone else?",
    "created": 1744249600,
    "label": "Neutral"
  },
  {
    "author": "Open_Oil_1586",
    "author_fullname": "t2_ueifhmct",
    "title": "Possibly the best no kyc exchange (BloFin)",
    "selftext": "When I was younger (under 18) I would struggle to send bitcoin to people because most exchanges or apps used to send crypto or stocks required you to put in your social security number to verify you’re an adult. However, I found a safe loophole. With BloFin you can buy, and send crypto without kyc identification (without putting in your ssn). So if any of you young “entrepreneurs” are in the same position as I was, scrolling on Reddit for an answer, BloFin is your solution. \nThis also goes for anybody trying to get into cryptocurrency who is a minor.",
    "created": 1744248300,
    "label": "Neutral"
  },
  {
    "author": "PopFirm5291",
    "author_fullname": "t2_but03eij0",
    "title": "Right now Other nation state and companies are at a Million Dollar question:",
    "selftext": "",
    "created": 1744247800,
    "label": "Unclear"
  },
  {
    "author": "Adorable_Incident717",
    "author_fullname": "t2_1fgem5lufe",
    "title": "For More Bitcoin Mining Related Content Check Out The Build-a-Mine Pod on YouTube!",
    "selftext": "",
    "created": 1744244000,
    "label": "Unclear"
  },
  {
    "author": "No_Cattle_1437",
    "author_fullname": "t2_up3x0a0cu",
    "title": "Random rant",
    "selftext": "So I first got into Bitcoin around 2017ish. I decided I would start dca'ing $10 a week. I stuck to it for about 2 months and then BTC dropped to around 20k and I got scared about dumping any more money into it however, I also never sold any of it. Over the following months turned into years and I pretty much forgot all about it until I started seeing that it was making waves again at the end of last year. I checked and to my surprise my money invested had more than doubled! Excited as I was, I still did not sell any. In fact, I finally started dca'ing again. Imagine if I had just stuck to my plan way back in '17 I'd have a pretty hefty chunk by now. Should, coulda, woulda... point is the best time to invest is yesterday, the next best time to invest is today. Even though as of today I'm only up 13% overall, at least something happened that got me back in. It's fun watching my Sats grow every week. I don't even really care what the USD value is at this point. I just continue to put in a little every week and I'm confident that over time my small investment will grow exponentially. Keep stacking my friends. ",
    "created": 1744243100,
    "label": "Bullish"
  },
  {
    "author": "goldticketstubguy",
    "author_fullname": "t2_6wbr3a4y",
    "title": "Let's keep this sub up to date now",
    "selftext": "https://preview.redd.it/8vh5hz3zawte1.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=2e00251dd321b96530bff8834b01dba787295533\n\n",
    "created": 1744242000,
    "label": "BearUish"
  },
  {
    "author": "High-Stakes-Capital",
    "author_fullname": "t2_1mygd0lhqf",
    "title": "Bitcoin in a nutshell",
    "selftext": "",
    "created": 1744241800,
    "label": "Unclear"
  },
  {
    "author": "PollabBTC",
    "author_fullname": "t2_1ideavqef0",
    "title": "Is not that difficult to succeed in this environment.",
    "selftext": "99% of people lose money trying to trade Bitcoin.\n\n100% of HODLers with at least 4 years in the market are green right now.\n\nStop thinking you're a genius and just buy and HODL your Sats. You're dumb like 99% of people (me included).\n\nIt's not that difficult:\n\n1. Pay all your monthly bills.\n\n2. See how much money you have left (if you have zero... Well... I will pray for you).\n\n3. Decide how much of that money will be used to buy Bitcoin. I will not say the annoying cliche \"OnLy iNveSt WhaT yOu cAn afFord tO lOsE\", because let's be honest..\nmost people can't afford to lose a single thing, they're desperate for a solution.\n\nSo the best advice I could give you is: Because of the halving cycle which happens every 4 years or so, Bitcoin tends to be higher than it was before after 4 years, but between the time you buy and that 4 year time frame, a bear market can occur. So make sure to just buy Bitcoin not with \"what you can't afford to lose\", but with an amount of money you can afford to leave untouched for AT LEAST 4 YEARS. That way if a bear market starts you can wait for a better opportunity to leave without selling at a loss.\n\nAnd finally:\n\n4. Besides the previously advice, the ideal scenario is: NEVER SELL YOUR BITCOIN. HODL FOREVER.\nThat's not some meme advice, there's a reason why people tell everyone that.\nIf you sell your Bitcoin you're exchanging a valuable asset that increases its value over time, for an asset (USD, EUR, etc) that is based on being infinitely printed, decreasing its value over time. Why the hell would you do that?\n\nIf you keep your money in Bitcoin, 4 years from now you will need less Bitcoin to buy the same stuff today. On the other hand if you keep your money in Fiat, you will need more Fiat to buy the same stuff today.\n\nThe only situation you should sell your Bitcoin for Fiat is if you need to use fiat to pay for something that will save your life or the life of someone you love. Because at the end of the day that's more important than money.\n\nBut if you have another choice, always chose not to sell your Bitcoin. You have no reason to sell your Bitcoin. You can spend your Bitcoin if you want and replace it later, that's what Bitcoin was created for. But don't exchange your valuable Sats for trash Fiat without a really good reason. I can guarantee that you will regret it in the next 4 years.",
    "created": 1744241700,
    "label": "Bullish"
  },
  {
    "author": "TotesGnar",
    "author_fullname": "t2_15jcqn",
    "title": "Bitcoin Freezer Analogy",
    "selftext": "I see a lot of people not understanding why Saylor says that Bitcoin is not competing with the dollar. I'll explain it by using my freezer analogy.\n\nBitcoin is like a freezer and the dollar is like a refrigerator. Freezers do not compete with refrigerators. When you go shopping for a new refrigerator you are not comparing it to your deep freezer you have at home. Why? Because they both do different things and both solve different problems we have with food.\n\nIf you want to make eggs and have those for breakfast *tomorrow* or in the next *week* you keep them chilled but not frozen. If you want to drink milk or use some cheese you are going to keep them in a ready state. Are they slowly going bad? Yes. But you are willing to accept that for the ability to consume them anytime you want in the short-term without having to wait or have a weird taste.\n\nIf you want to preserve steak for 6+ months because you know you'll use it, just not sure when, you deep freeze it. If you want to keep food with certain properties because they are better that way (such as ice cream) you deep freeze it. Sure, you could always take the steak out and eat it, but it's going to hurt, a lot.\n\nIf you take Bitcoin and spend it, it's going to hurt, a lot. It's highest and best use case is not as a currency. It *can* be used as a currency just like the frozen steak *can* be eaten, however that's not ideal. It's highest and best use case is as a store of value against all other forms of spoilage and decay.\n\nLast thought and I'll leave you with this....... Imagine you go over to your family's house and every time you're there they complain about food going bad and how they cannot store lots of meat and other things like ice cream. They don't understand how other people are doing it. And when you ask them to show you, you notice they only have a refrigerator in their kitchen! Well, your solution for them wouldn't be to tell them to get rid of the refrigerator because that's the thing causing them to not store food long term. You would tell them that they need to go buy a freezer and that will allow them to not only store food for longer but more of it! They can keep the refrigerator, it has it's place in the kitchen, but they need to understand it's purpose and that they're not supposed to use it to store ice cream.\n\nThis is what Michael Saylor means when he says that Bitcoin doesn't compete with the dollar.",
    "created": 1744235000,
    "label": "Bearish"
  },
  {
    "author": "TheHeaviestShow",
    "author_fullname": "t2_sy1b8w43",
    "title": "Thoughts on Creature From Jekyll Island?",
    "selftext": "A lot of this book is definitely factual, and can easily be proven. I'm sure most of us here understand that much.\n\nThe questions I have are regarding the whole \"Socialist New World Order\" type stuff. What the author speaks to is eerily similar to what the WEF and IMF have going on world wide. I've always been skeptical of this part of the book, but lately my noggin has been joggin in this direction, especially being Canadian.\n\nWhat's your guys' thoughts on this book and the more \"conspiratorial\" aspects of it?",
    "created": 1744234500,
    "label": "Neutral"
  },
  {
    "author": "dbudlov",
    "author_fullname": "t2_zks5w",
    "title": "Bitcoin vs Fiat: Escape the Financial Balloon",
    "selftext": "",
    "created": 1744234400,
    "label": "Unclear"
  },
  {
    "author": "pasafe",
    "author_fullname": "t2_5io7m5e2",
    "title": "Can someone explain?",
    "selftext": "Is the \"vol:\" the amount of bitcoin bought and sold by individual buyers and sellers? and is this volume normal. ",
    "created": 1744233000,
    "label": "Neutral"
  },
  {
    "author": "Local_Mood_5500",
    "author_fullname": "t2_1f31qprp52",
    "title": "Bitcoin",
    "selftext": "Why isn't Bitcoin's block size increased?",
    "created": 1744230500,
    "label": "Neutral"
  },
  {
    "author": "Amphibious333",
    "author_fullname": "t2_ofsn3p2kh",
    "title": "Is escaping the Matrix possible with Bitcoin?",
    "selftext": "I'm diversifying with some low and average return investments, but Bitcoin is the only investment that surpasses every single other investment on Earth. So, my biggest bet and hope is on Bitcoin, not the other investments.\n\nIf a miracle is going to happen, it will be performed by Bitcoin, not the other things I invest in. I do acknowledge that.\n\nThe most important question is, is escaping the Matrix and the 9-5 still possible or not?\n\nBTC is the highest return investment currently in existence, but if the market cap doesn't reach 15-20T, I don't see how BTC can help me escape.\n\nSince BTC is the highest return asset on Earth, if it can't help, then nothing can.\n\nShould I just give up or keep living in artificial scarcity made by me so I can have more money to invest in Bitcoin?\n\nPsychologically, I may be able to withstand to 2040, but continuing after that won't be possible. In other words, Bitcoin will either succeed long-term or I will press my turn off button (you know what I mean 😢 )\n\nGive me only serious answers.\n\nThanks.",
    "created": 1744229100,
    "label": "Bullish"
  },
  {
    "author": "PresentAdvertising29",
    "author_fullname": "t2_8nwbxaox",
    "title": "Your theory on why Bitcoin is underperforming this rally?",
    "selftext": "Will it catch up? Are people shell shocked, and more scared to buy into it than they are into stocks? Is sentiment soft for some other reason? ",
    "created": 1744227700,
    "label": "Neutral"
  },
  {
    "author": "fbacaleb",
    "author_fullname": "t2_39nl9nwe",
    "title": "Alright which one of you is this?",
    "selftext": "",
    "created": 1744226700,
    "label": "Unclear"
  },
  {
    "author": "Mustafa3595",
    "author_fullname": "t2_a6zypf50w",
    "title": "Just HODL",
    "selftext": "The weak sold.\nThe strong HODL.\n\n\nYeah, the price is up now—but it might dip again.\n\nLet traders play each other. But I’m not playing their game. I’m just HODLING. You only lose money if you sell.\n\n1 BTC = 1 BTC\n\n\nw/e\n\nsue me\n(but only if it’s payable in BTC)",
    "created": 1744226600,
    "label": "Bullish"
  },
  {
    "author": "Western-Set-8642",
    "author_fullname": "t2_194udustvw",
    "title": "So how many times has bitcoin died and that's its all a scam",
    "selftext": "Let's all count ",
    "created": 1744226600,
    "label": "Unclear"
  },
  {
    "author": "Turbulent_Dog414",
    "author_fullname": "t2_pv7gudxx",
    "title": "Happy birthday, Len Sassaman",
    "selftext": "We will always remember the brilliant things you have created. Thank you. Rest in peace",
    "created": 1744226000,
    "label": "Unclear"
  },
  {
    "author": "hphoood",
    "author_fullname": "t2_4wdvowxc",
    "title": "Welcome to BTC!!",
    "selftext": "Just a message to welcome anyone new… I hope u all feel the emotional nothingness of this spike.. just go to work and DCA.. enjoy your retirement. ",
    "created": 1744222000,
    "label": "Bullish"
  },
  {
    "author": "Life-Observer",
    "author_fullname": "t2_4mz44d86",
    "title": "Bitcoin Miners visualized",
    "selftext": "imagine investing in these abominations ",
    "created": 1744221300,
    "label": "Bearish"
  },
  {
    "author": "Flaky_Lab_1104",
    "author_fullname": "t2_n3p8m1r3",
    "title": "Btc card now on revolut damn she is so nice",
    "selftext": "",
    "created": 1744221300,
    "label": "Bullish"
  },
  {
    "author": "TheRealPrecisionYT",
    "author_fullname": "t2_7d5y4p61",
    "title": "Since no one else said it",
    "selftext": "We are so back",
    "created": 1744220500,
    "label": "Bullish"
  },
  {
    "author": "Intelligent-Edge7533",
    "author_fullname": "t2_ios5c91k1",
    "title": "Options for cashing out in other currencies?",
    "selftext": "How does one go about selling BTC for an amount of foreign currency? Or do you have to sell it for your country’s fiat and then convert it? ",
    "created": 1744220000,
    "label": "Unclear"
  },
  {
    "author": "Mauritz_m",
    "author_fullname": "t2_8ilpdbkl",
    "title": "What a lucky coincidence... or not?",
    "selftext": "Considering the current run on bitcoin (global acceptance, big corporations and states are becoming interested in buying etc.), many big players NEED BTC price low to buy in cheap. They WANT retail investors to sell so the price drops. And then, when the market is in total fear, they buy in billions. Isn't it always the same... :)\n\n  \nStay strong, don't get freaked out by the short term uncertainties and #HODL 🧡",
    "created": 1744219900,
    "label": "Bullish"
  },
  {
    "author": "yourfriendmujina",
    "author_fullname": "t2_175l9h7gh8",
    "title": "The Future of the United States’ Economy — is There One?",
    "selftext": "*From my substack.*  \n  \n*Update: Today, Chinese tariffs have increased from the previously calculated 54%, to 105%. This has taken the estimated 5% increase in inflation from tariffs alone, to 7.1%,* ***bringing the total inflation estimates within a year from now to around 10%*** *— and this is without an increase in the money supply, just from rising prices.* *Depending on the response in interest rates from the Federal Reserve, this could rise.*\n\n*The used estimates are not meant to be perfectly accurate, but rather a numerical representation of principles at play. A friend pointed out the important factor that many of the goods imported from countries under high tariffs, like China, will be replaced with countries that have lower tariffs, which is not taken account in the following math. Due to the difficulty in such estimates, it will be purposefully left out, but I would keep it in mind.*\n\n*This is financial information, not advice.*\n\n*--*\n\nI wrote an article attaching theoretical increased inflation numbers that could occur due to recently announced vehicle tariffs by the United States. This resulted in an estimated **1.6%** CPI increase. Add that to the last reported inflation rate of 3.14%, resulting in a significant **4.74% inflation rate with auto tariffs alone.**\n\nAt the time, the automobile tariffs were considered the biggest factor in terms of anticipated economic impact — but now pale in comparison to the recent announcement, which apply to all goods including The United States’ major trading partners.\n\nPutting the economic impact of new tariffs into perspective, about 10 to 17% of items purchased in the CPI basket are imported goods. Due to production processes including imported goods but assembled in the US and other factors, I’d venture to say the 17% number is closer to accurate.\n\nWe’ll do some very quick on a napkin on the back of a hand math:\n\nOf that 17% of the CPI basket, here are it’s compositional estimates, and associated price increases with the new tariffs:  \n29% comes from China, 4.93% of the total basket, with 72.27% increase in item cost.  \n26% from Mexico, 4.42% of the total basket, with 25% increase in item cost.  \n15% from EU, 2.55% of the total basket, with 16.5% increase in item cost.  \n10% from Vietnam, 1.7% of the total basket, with 36.25% increase in item cost.  \n9% from Canada, 1.53% of the total basket, with 25% increase in item cost.  \n11% from elsewhere, 1.87% of the total basket, with 9.52% increase in item cost.\n\nIf you calculate a $100 basket of CPI goods with old tariffs, it would cost $106.27 with the new tariffs. **An inflation increase of 6.27%**\n\nhttps://preview.redd.it/cgz1n5zngute1.png?width=1882&amp;format=png&amp;auto=webp&amp;s=fc503260d5642c7383f99b17534fc09365502206\n\n*Note: This is a general estimate assuming that imported goods are evenly weighted across the CPI basket. One could get a more accurate estimate by narrowing down what percentage of each weighted category is made by which country, but such specificity on what is already a guesstimate is unnecessary. The ‘other’ imported category is an assumed 9.52% increase, but with the new tariffs, it’s likely more significant.*\n\nLet’s take that 6.27% and add in some other factors.\n\nThese calculations have included the auto tariff previously calculated, but not insurance, which was a .25% increase, bringing our total increase to 6.52%\n\nDomestic production is also influenced by tariffs. We will add a conservative .33% increase in cost of CPI goods by domestic sources giving us **an estimated total 6.85% inflationary increase.**\n\nAdd that onto the current inflation rate of 3.14% and **we could see 10% inflation numbers within a year**. I believe this to be conservative.\n\nAverage US citizens are already struggling to live day to day, and these tariffs are a strong squeeze on an already stressed economy with little wiggle room. Any more pressure could cause economic flatline, and a significant step towards broader debt default. The Federal Reserve will have to lower rates at some point, the question is just how much blood will be in the street before they do — and if past sentiment prevails, I’m willing to guess quite a bit.\n\nLet’s observe some potential universes resulting from this situation.\n\n**Universe 1: Interest rates** ***are*** **lowered significantly and/or quickly enough to prevent significant economic damage. United States’ domestic production** ***also*** **increases in time.**  \nThis is best case scenario. Yes, inflation significantly increases, but so do domestic jobs. Your eggs now cost $6/dozen, but you and your friends are employed, and ideally $20k more a year than pre-tariff.\n\nYou can think of this equivalent to the United States creating significantly more USD, but most of it going to US citizens rather than foreign entities. I’m in assumption that this is the actual end goal of the current administration.\n\n**Universe 2: Interest rates** ***are not*** **lowered significantly and/or quickly enough to prevent significant economic damage. United States’ domestic production** ***does not*** **increase in time**.  \nA lack of cooperation between the US Federal Reserve and The White House would result in these tariffs wrecking the US Economy. Significant job loss and rising cost of living would create broad loan defaults, including the US government, leading to potential bank runs, etc. However, I don’t think a point of no return is truly the case, and can probably be remedied at some point through evasive action.\n\nIf you’ve seen or read Ray Dalio’s The Changing World Order, he mentions that nations would rather inflate their currency than default on loans and I agree. So it’s not a matter of *if* The Fed increases rates, but rather *when* they do, and if they do so adequately. The variable is how many people and businesses economically or spiritually die before then.\n\nNo matter the universe we enter, it will contain inflation, and economic instability. Those are the two economic conditions you can count on.\n\nHow to prepare for such environments? Seek antifragile philosophy, live off of less, contribute what you can, and the universe will give back.",
    "created": 1744219800,
    "label": "Unclear"
  },
  {
    "author": "daveinit8",
    "author_fullname": "t2_p0o1rnu",
    "title": "Could M2 expansion benefit Bitcoin?",
    "selftext": "Here is my opinion in light of recent events, although not investment advice but worth reflecting:  \n  \nThe Fed is beginning to identify signs of serious cracks in the US bond market. There will be no longer the money from the export of dollars that the trade surpluses generated in favor of the Asian tigers. There will be no longer this money to buy treasuries, bonds and government securities issued by the US Treasury Department. There will be no longer this money, what will replace the Asian tigers will be the M2. I would not doubt that BTC in the next few days could eventually explode to 85,000 or 87,000. It is not a question of catching the falling knife, as some say, it is a question of mathematics. If the Fed does not turn on the money printer immediately, the world as we know it will simply disappear.\n\nI'd like to hear your thoughts about how this could benefit Bitcoin in the mid to long term.",
    "created": 1744219400,
    "label": "Bullish"
  },
  {
    "author": "QuantumHavoc",
    "author_fullname": "t2_12lp4o1968",
    "title": "China and Russia are now using Bitcoin to settle energy trades, signaling broader shift away from U.S.-led financial systems.",
    "selftext": "",
    "created": 1744218600,
    "label": "Unclear"
  },
  {
    "author": "Cold-Enthusiasm5082",
    "author_fullname": "t2_1jipbtbitu",
    "title": "I'm buying",
    "selftext": "",
    "created": 1744218600,
    "label": "Bullish"
  },
  {
    "author": "BubeBGD",
    "author_fullname": "t2_4nuzlmcc",
    "title": "Book recommendations",
    "selftext": "What are some books that aren’t necessarily about Bitcoin, but you'd still recommend to a Bitcoiner?\nOpen to all genres.",
    "created": 1744217100,
    "label": "Unclear"
  },
  {
    "author": "still-trying-99",
    "author_fullname": "t2_1lgg74wjyl",
    "title": "Mastering Bitcoin 3rd Edition",
    "selftext": "I am trying to find the book Mastering Bitcoin 3rd Edition by Andreas M. Antonopoulos. The official source is in GitHub, the above link.\n\nBut does anyone know where can I find the book in pdf to read offline? Wherever I search, either they are 2nd edition or a condensed form of 3rd edition.",
    "created": 1744216800,
    "label": "Unclear"
  },
  {
    "author": "SecretCranberry8205",
    "author_fullname": "t2_cq9t5llbl",
    "title": "Is LocalCoinSwap safe?",
    "selftext": "I need some bitcoin and for reasons I won’t discuss here I’ve decided to acquire it p2p. It looks like LocalCoinSwap is one of the standards and I have been talking with several sellers there. I am a little concerned that I will be getting scammed as I am spending a pretty penny and I have to use a prepaid Visa card. So my question lies if LCS is scam protected?",
    "created": 1744215800,
    "label": "Unclear"
  },
  {
    "author": "TadBitGains",
    "author_fullname": "t2_17otvpcjt7",
    "title": "Only reason I didn't buy more this month is because of Uncle Sam",
    "selftext": "Tax season is upon us. Bitcoin is down 10% in the last week so this would've been a perfect time to stack some more. Will buy more next month. HODL in the meantime.",
    "created": 1744215600,
    "label": "Bullish"
  },
  {
    "author": "Prior-Ad2726",
    "author_fullname": "t2_hc8mgva2",
    "title": "We will know if bitcoin is digital gold soon",
    "selftext": "I’m not a financial expert, but this is my simple idea: If Bitcoin is digital gold and a store of value, it should be going up ( or at least not drops -70,-80%) during this unstable condition, just like gold did in 2008. I believe in Bitcoin and keep buying it so far. If it drops below $50,000, that would suck, and you’d have your answer about its performance in this recession.\nTill now look like its doing well 🙏🏻\n",
    "created": 1744214700,
    "label": "Unclear"
  },
  {
    "author": "Otherwise-Buyer8103",
    "author_fullname": "t2_1fcd3q85ze",
    "title": "I have like 25 usd worth of btc (thats a lot in my country) how much will it increase just seeking for advice before i put 50 or 100bucks",
    "selftext": "I have like 25 usd worth of btc (thats a lot in my country) how much will it increase just seeking for advice before i put 50 or 100bucks",
    "created": 1744214300,
    "label": "Unclear"
  },
  {
    "author": "Imaginary_Abroad8733",
    "author_fullname": "t2_8rj1njmlo",
    "title": "Today is my personal Bitcoin Holiday",
    "selftext": "Eleven years ago today, I bought BTC for the first time. It was under $500. In 2014 there were not as many exchanges, so I used Coinbase like practically everyone did. \n\nI think everyone should celebrate their own BTC Holiday.\n\nI still hold that Bitcoin, btw.",
    "created": 1744213900,
    "label": "Bullish"
  },
  {
    "author": "unchainedcap",
    "author_fullname": "t2_md03n4i",
    "title": "We're hosting a free video premiere of Parker Lewis and Dhruv Bansal presenting \"Bitcoin, Not Crypto\" at UATX",
    "selftext": "",
    "created": 1744212500,
    "label": "Unclear"
  },
  {
    "author": "lilychinks",
    "author_fullname": "t2_805bw",
    "title": "Any events coming up?",
    "selftext": "This April has been really crazy but what measures are being taken if this persists? So somebody tell me what's being planned and events for that matter.",
    "created": 1744212400,
    "label": "Unclear"
  },
  {
    "author": "DreamingTooLong",
    "author_fullname": "t2_ydmmse9n5",
    "title": "The whales are making my CoinGlass go crazy",
    "selftext": "",
    "created": 1744211800,
    "label": "Bullish"
  },
  {
    "author": "GeeWow",
    "author_fullname": "t2_c84pu",
    "title": "Your Daily Bitcoin Breakdown newsletter is now live. Check out today’s Top Stories and a sneak peek at the latest Quick Bits snippets. Full issue link is in the comments.",
    "selftext": "",
    "created": 1744211300,
    "label": "Unclear"
  },
  {
    "author": "Todo_es",
    "author_fullname": "t2_vpsq308p",
    "title": "Phoenix Wallet Is Back (Great News)",
    "selftext": "",
    "created": 1744208400,
    "label": "Bullish"
  },
  {
    "author": "OkEstablishment7095",
    "author_fullname": "t2_1v6v2q3t",
    "title": "\"What inspires me the most is just the community driving it\"",
    "selftext": "",
    "created": 1744208300,
    "label": "Bullish"
  },
  {
    "author": "crasherrrrrr",
    "author_fullname": "t2_18g3cuy5vz",
    "title": "Binance gift cards",
    "selftext": "Hello fellow reddit fam Any legit sites that sell binance gift cards? ",
    "created": 1744207900,
    "label": "Neutral"
  },
  {
    "author": "codeagencyblog",
    "author_fullname": "t2_6ju8n5rq",
    "title": "Galaxy Digital’s Nasdaq Move: A Big Step for Crypto and AI",
    "selftext": "",
    "created": 1744207700,
    "label": "Bullish"
  },
  {
    "author": "relaiapp",
    "author_fullname": "t2_vh22ibg0",
    "title": "JUST IN: 🇺🇸 White House Crypto Czar David Sacks to speak at Las Vegas Bitcoin conference next month",
    "selftext": "",
    "created": 1744207200,
    "label": "Bullish"
  },
  {
    "author": "EkariKeimei",
    "author_fullname": "t2_sv4xef",
    "title": "Zen Bitcoinism",
    "selftext": "Is the S&amp;P down (or up)? 1 BTC = 1 BTC.\n\nIs liquidity down (or up)? 1 BTC = 1 BTC.\n\nIs the M2 already reversed? 1 BTC = 1 BTC.\n\nIs the greed/fear index into the greed/extreme greed? Calm down. Hodl.\n\nIs the greed/fear index into the fear/extreme fear? Calm down. Stack sats.\n\nBreathe.\n\nIs the government changing its tax code? Calm down. Get your coin off the exchanges.\n\nIs the government adopting a bitcoin reserve? Calm down. Get your coin off the exchanges.\n\nIs the mempool bare and mining fees low? Maybe consider you may want to consolidate UTXOs.\n\nBreathe.\n\nIs Satoshi Nakamoto's identity to be revealed? Calm down. No one is satoshi. We are satoshi.\n\nIs someone suing a scammer or CEO of a CEX? Calm down. Stack sats.\n\nIs someone getting their MtGox compensation? Calm down. Hodl.\n\nBreathe.\n\nWe are unstoppable.",
    "created": 1744205600,
    "label": "Bullish"
  },
  {
    "author": "GGCaaeb",
    "author_fullname": "t2_72znk051",
    "title": "Freedom money",
    "selftext": "If you have a deep understanding of money and Bitcoin, times like this show who is here just to buy Bitcoin and sell it later for fiat. And who truly understands Bitcoin. Some of us don’t want their petro forever war dollars, we want Bitcoin. We get more Bitcoin now, keep DCAing. Study money more, study bitcoin more and you will soon never care what the price of Bitcoin is you will always want more.\nBitcoin was created after the 2008 crash, Satoshi saw that was a big problem with money we are forced to use. After you take the orange pill there is no turning back.",
    "created": 1744205200,
    "label": "Bullish"
  },
  {
    "author": "No-Abbreviations1122",
    "author_fullname": "t2_9l10rahw",
    "title": "How Safe is Blue wallet?",
    "selftext": "I have all my Funds on a Blue wallet. How safe is it when I write down the passphrases an delete the wallet on Blue wallet?",
    "created": 1744200800,
    "label": "Bearish"
  },
  {
    "author": "2themooonwego",
    "author_fullname": "t2_1g6q0a8kp8",
    "title": "What is the cheapest way?",
    "selftext": "This has probably been asked before but…\n\nWhat is the cheapest way to purchase 1 full BTC to avoid fees?\n\nI reside in the US. \n\n",
    "created": 1744199300,
    "label": "Neutral"
  },
  {
    "author": "liammxokellehh",
    "author_fullname": "t2_81goylxl",
    "title": "0.21 percent of a bitcoin",
    "selftext": "Simply put is that like average ? Is that less or more then most people or the population have? \n\nNevermind cost basis like.",
    "created": 1744197600,
    "label": "Neutral"
  },
  {
    "author": "is_NAN",
    "author_fullname": "t2_cyvrevqxs",
    "title": "How much BTC is safe on Exchanges?",
    "selftext": "I've been into Bitcoin for almost five years now. Back in the day, I picked some up for just a few hundred bucks and ended up taking profits in the thousands. Honestly, I never wanted to sell, but life had other plans and I had no choice at the time.\n\nThankfully, I've bounced back since then and have been slowly stacking again over the past six months. While I don't have the same buying power as before, I'm still glad to be back in the game, even if I'm holding about a tenth of what I used to.\n\nThat said, I’ve always kept my BTC on exchanges just because it makes buying super convenient for me. But I do realize that coins on an exchange are kind of like fiat, just numbers on a screen, not truly yours.\n\nSo here’s my question: at what point does keeping BTC on an exchange become too risky? Is there a certain limit or rule of thumb you follow before moving funds off to self-custody?",
    "created": 1744190200,
    "label": "Neutral"
  },
  {
    "author": "bowie9191",
    "author_fullname": "t2_7qum79gh",
    "title": "In what ways does bitcoin differ from gold in terms of its role in the end of a big debt cycle?",
    "selftext": "Lets assume we are witnessing the end of a big debt cycle, in which the dollar will spiral into oblivion, and a new reserve currency will eventually emerge and be pegged to a hard asset like gold or bitcoin (historically speaking, this has always happened). A situation where a CBDC \"new dollar\" or euro is pegged to bitcoin or gold for example. \n\nEventually, they would de-peg it to print more since they would have the ability to do so.\n\nSo my question is, how is bitcoin any different than gold in this regard? Gold did not solve the problem of central banks ability to print and debase currency, how would something pegged to bitcoin differ in any way? People could still transact in gold always, but obviously, due to portability and verifiability issues, it did not make it very convenient to do so. \n\nIs this where bitcoin differs? People would be able to transact without the hurdles of gold, and in theory would actually PREFER to transact in bitcoin rather than a CBDC? \n\nI think we are witnessing a global order restructuring in real time and all roads lead to bitcoin, but just curious on how that could look like? How would it be different than any other time where a new currency is created, and to give it confidence, it is pegged to a hard asset like gold. How would pegging it to bitcoin be any different? \n\nIs the general belief that no other currency will exist because they would not be able to compete with the immutability and \"hardness\" of bitcoin?\n\nAny insights would be greatly appreciated! Thanks in advance",
    "created": 1744188400,
    "label": "Bullish"
  },
  {
    "author": "hostedenis",
    "author_fullname": "t2_tpguc",
    "title": "Let’s keep buying at these prices",
    "selftext": "Special price as well 😅",
    "created": 1744187100,
    "label": "Bullish"
  },
  {
    "author": "rBitcoinMod",
    "author_fullname": "t2_tcsf5",
    "title": "Daily Discussion, April 09, 2025",
    "selftext": "Please utilize this sticky thread for all general **Bitcoin** discussions! If you see posts on the front page or /r/Bitcoin/new which are better suited for this daily discussion thread, please help out by directing the OP to this thread instead. Thank you!\n\nIf you don't get an answer to your question, you can try phrasing it differently or commenting again tomorrow.\n\nPlease check the [previous discussion thread](https://www.reddit.com/r/Bitcoin/comments/1ju6s67/daily_discussion_april_08_2025/) for unanswered questions.",
    "created": 1744178400,
    "label": "Unclear"
  },
  {
    "author": "Interesting-Meat-372",
    "author_fullname": "t2_a1krce5t",
    "title": "THIS DOCUMENTARY ABOUT BITCOIN IS INCREDIBLE",
    "selftext": "I just finished watching this Bitcoin documentary, and I'm now even more convinced that Bitcoin is the path to financial freedom.\n\nhttps://m.youtube.com/watch?v=oksraL7wN6Q",
    "created": 1744175900,
    "label": "Bullish"
  },
  {
    "author": "pieredforlife",
    "author_fullname": "t2_15wj8sn",
    "title": "Will you stand up for your beliefs?",
    "selftext": "",
    "created": 1744174300,
    "label": "Unclear"
  },
  {
    "author": "TheReader369",
    "author_fullname": "t2_1mr24407bc",
    "title": "What is the best way to store Bitcoin?",
    "selftext": "If you could classify just one way to store Bitcoin, what would it be and why?",
    "created": 1744168200,
    "label": "Neutral"
  },
  {
    "author": "Mark_Logan",
    "author_fullname": "t2_tuvw",
    "title": "I never thought I would see this day.",
    "selftext": "Finally got my payout from the MTGOX implosion. I was actively trading at the time, and happened to have my balance in fiat at the time it went offline. It would have been around 2BTC at the moment they collapsed. ",
    "created": 1744165800,
    "label": "Neutral"
  },
  {
    "author": "JoAl1209",
    "author_fullname": "t2_55zpcxjw",
    "title": "I’m not a finance major, but neither is the finance professor",
    "selftext": "I don’t go to college, but my friend is a finance major. His professor always goes on rants about how Bitcoin is a scam and it pisses off my friend. I don’t know a lot about btc or the economy, so don’t hate me if I get any of this wrong. I just thought it was funny",
    "created": 1744165500,
    "label": "Bearish"
  },
  {
    "author": "Disastrous_Fee5953",
    "author_fullname": "t2_cqxj7l6s",
    "title": "Recommended exchanges in Japan",
    "selftext": "I live in Japan and unlike the U.S. we aren’t exactly spoiled for choice when it comes to ways in which we can purchase bitcoin. Most of the exchanges that are frequently recommended here (Kraken, River, Coinbase) do not operate in Japan. I’ve been using Binance to buy and immediately withdraw into my cold wallet, but their JPY to bitcoin exchange rates are pretty bad. Are there any better options outs there?",
    "created": 1744164000,
    "label": "Neutral"
  },
  {
    "author": "DuckDuckMosss",
    "author_fullname": "t2_17fsbcuy4q",
    "title": "Don't be a pleb in this market",
    "selftext": "People here are panicking like it's the end of the world.\n\nLike they don’t have a job that lets them buy a little Bitcoin every week, even if prices drop more. Like they don’t have enough savings to ride out a bear market. If you don’t have those basics, what are you even doing? You’ve got no business chasing life-changing gains if your own life is hanging by a thread.\n\nIf you’re living paycheck to paycheck, hoping your $1,000 portfolio will fix everything—wake up. Bitcoin isn’t a magic ticket out of a mess you made. It’s an asset for people who have their foundations in place—a steady job, an emergency fund, and the patience to stick around when everything starts to collapse.\n\nThe people winning in Bitcoin are the ones who are prepared. They buy when everyone else is too scared to. They don’t lose their minds when the market crashes because they knew it could happen—and they planned for it.\n\nMost people here are just gambling addicts in disguise—calling themselves \"investors\" while chasing life-changing gains without a backup plan. If that’s you, stop lying to yourself. You don’t need Bitcoin at the moment—you need to sort out your financial life first.\n\nIf you want to win in this game, get the basics right. Make good money, save like you mean it, and only start buying Bitcoin when your finances are in a good place and you’ve got extra cash to allocate.",
    "created": 1744162600,
    "label": "Bullish"
  },
  {
    "author": "FunWithSkooma",
    "author_fullname": "t2_kenmnni",
    "title": "You guys know that when you buy Bitcoin",
    "selftext": "You should move it out of the exchange, right?",
    "created": 1744162200,
    "label": "Neutral"
  }
]